// 1. 函数嵌套函数  作用域叠加
// 2. 内部函数可以在外部访问， 如果无法访问没有意义。不会随着外部函数的出栈
// 3.  被闭包的函数在外部访问时， 变量查找？ 作用域, 作用域链查找
// js 作用域链是静态， 有函数申明的时候函数所在的位置决定， 而不是执行的时候。
// 任何函数， 执行时， 短暂的编译， 上下文， outer 属性  指向 作用域链查找的方向 
function foo() {
  function bar() {
    var a = 1
    console.log(b);
  }
  var b = 2; // 
  return bar
}
// var b = 3;
foo();
const baz = foo() // this 指向 动态  能销毁吗？一定是要离开调用栈的栈顶的，
// 垃圾回收？ 矛盾就来了， 函数回收了， 但是它会将 bar 需要的 { b: 2} 
// 闭包， 其实就是一个背包（堆内存中 不会因为外层函数的出栈被回收），  放到这个背包里面  闭合在两个函数间的变量背包。
// 把闭包中的变量叫自由变量  outer 指向 闭包地址
baz(); //  bar函数  入栈， outer 指向 foo, 引用到 foo b 